Repository: gheyret/english2uyghur
Catalog: xfce-uyghur.tmx
Source language: en_us
Languages: ug

source: This font will be used as the default font used when drawing user interface text
ug: بۇ فونت كۆرۈنمە يۈزدە ئىشلىتىلىدىغان كۆڭۈلدىكى فونت قىلىپ ئىشلىتىلىدۇ

source: This is %s version %s
ug: بۇ بولسا %s نەشرى %s

source: This is %s version %s, running on Xfce %s.
ug: بۇ %s ، نەشرى %s، Xfce %s دا ئىجرا بولۇۋاتىدۇ.

source: This is a reply to a public bug tracker
ug: بۇ ئاممىۋى كەمتۈك ئىزلىغۇچقا قايتۇرۇلغان جاۋاب

source: This is an easy speed reading utility to help train you to read faster. It does this by flashing words at a rapid rate on the screen.
ug: تېز ئوقۇشنى مەشىق قىلىش قورالى. ئۇ ئېكراندا سۆزلەرنى تېز سۈرەتتە يېڭىلاش ئارقىلىق تېز ئوقۇشنى مەشىق قىلىشقا ياردەم بېرىدۇ.

source: This is just the default value, you can change it in the actual eventlist window.
ug: بۇ پەقەتلا كۆڭۈلدىكى قىممىتى، بۇنى eventlist كۆزنىكىدە ئۆزگەرتكىلى بولىدۇ.

source: This is not used for the actual mount, only necessary for opening the mount point in a file browser
ug: بۇ رەسمىي ئېگەرلەشتە ئىشلىتىلمەيدۇ، پەقەتلا ھۆججەت كۆرگۈدە ئېگەرلەش نۇقتىسىنى ئېچىش ئۈچۈن كېرەك بولىدۇ.

source: This is only useful and recommended if you specify "sync" as part of the "unmount" command string.
ug: بۇ تاللانما «unmount» بۇيرۇقىغا «sync» قوشۇلغاندا ئىشلىتىش تەۋسىيە قىلىنىدۇ.

source: This is special category, which can be used to color this appointment in list views.
ug: بۇ ئالاھىدە كاتېگورىيە بولۇپ، تىزىم كۆرۈنۈشىدىكى دېيىشمىلەر رەڭلىك كۆرسىتىلىدۇ.

source: This is the device name (interface name) for the established connection, such as: <b>ppp0</b> To determine the device name, you can execute the next command before and after establishing the connection: <b>cat /proc/net/dev</b> This will show the active devices/interfaces in the first column. The new device after establishing the connection is the device/interface name required.
ug: بۇ باغلانغان ئۈسكۈنىنىڭ ئاتى، يەنى: <b>ppp0</b> ئۈسكۈنە ئاتىنى بىلىش ئۈچۈن باغلىنىشنىڭ ئالدى كەينىدە تۆۋەندىكى بۇيرۇقنى ئىجرا قىلىڭ: <b>cat /proc/net/dev</b> كۆرۈنگەن ئۇچۇرلارنىڭ بىرىنچى ئىستوندىكىسى ئاكتىپ ئۈسكۈنە/ئارايۈزنىڭ ئاتىدۇر. باغلىنىپ بولغاندىن كېيىنكى يېڭى ئۈسكۈنە دەل زۆرۈر بولغان ئۈسكۈنە/ئارايۈزنىڭ ئاتىدۇر.

source: This is the first time you've run the Xfce Volstatus Icon application
ug: Xfce Volstatus سىنبەلگە پروگراممىسىنى تۇنجى قېتىم ئىجرا قىلدىڭىز

source: This is the location of the configuration file that includes the preferences which control the look and feel of @PACKAGE_NAME@.
ug: بۇ @PACKAGE_NAME@ نىڭ كۆرۈنۈشىنى كونترول قىلىدىغان خاسلىقلارنى ئوز ئىچىدە ئالغان سەپلىمە ھۆججەتنىڭ ئورنىدۇر.

source: This is the name of the lock file created by the connection command, such as: <b>/var/lock/LCK..ttyS1</b> You can frequently find this name by checking the content of /var/lock before and after establishing the connection. The absence of that file indicates to the plugin that no connection has been established and that no dialing is in progress.
ug: بۇ باغلىنىپ بولغاندىن كېيىن قۇرۇلغان قۇلۇپ ھۆججىتى، يەنى: <b>/var/lock/LCK..ttyS1</b> باغلىنىشنىڭ ئالدى كەينىدە /var/lock دېگەن يەردە بۇنداق ھۆججەتنى پات-پات ئۇچرىتىشقا بولىدۇ. ئەگەر بۇ ھۆججەت بولمىسا، قىستۇرما باغلىنىشنىڭ يوق ۋە تېلېفونمۇ قىلىنمىغان دەپ قارايدۇ.

source: This library is free software; you can redistribute it and/or modify it under the terms of the GNU Library General Public License as published by the Free Software Foundation; either version 2 of the License, or (at your option) any later version. This library is distributed in the hope that it will be useful, but WITHOUT ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the GNU Library General Public License for more details. You should have received a copy of the GNU Library General Public License along with this library; if not, write to the Free Software Foundation, Inc., 51 Franklin Street, Fifth Floor, Boston, MA 02110-1301 USA.
ug: بۇ ئامبار ئەركىن يۇمشاق دېتال؛ سىز ئەركىن يۇمشاق دېتال ۋەخپىسى تارقاتقان GNU ئادەتتىكى ئاممىۋى ئىجازەتنامە بويىچە ئۇنى قايتا تارقىتىپ ياكى ئۆزگەرتەلەيسىز؛ سىز شۇ ئىجازەت كېلىشىمىنىڭ ئىككىنچى نەشرى ياكى يۇقىرى نەشرىنى ئىشلەتسىڭىز بولىدۇ(ئۆزىڭىز تاللايسىز). بۇ پروگراممىنى تارقىتىشتىكى مەقسەت سىزگە قۇلايلىق ئېلىپ كېلىش، ئەمما سودا ياكى باشقا ئالاھىدە قوللىنىشقا نىسبەتەن ھېچقانداق كاپالەت يوق. تېخىمۇ كۆپ تەپسىلاتلارنى GNU ئادەتتىكى ئاممىۋى ئىجازەتنامىسىدىن كۆرۈڭ. مەزكۇر پروگرامما بىلەن بىرگە ئادەتتىكى ئاممىۋى ئىجازەتنامە(GNU General Public)سى چوقۇم بىرگە بولىدۇ. ئۇنداق بولمىسا ئەركىن يۇمشاق دېتال ۋەخپىسىگە خەت يېزىڭ. ئادرېسى: 51 FranklinStreet, Fifth Floor, Boston, MA 02110-1301, USA.

source: This library is free software; you can redistribute it and/or modify it under the terms of the GNU Lesser General Public License as published by the Free Software Foundation; either version 2.1 of the License, or (at your option) any later version.
ug: بۇ فۇنكسىيە ئامبىرى ئەركىن يۇمشاق دېتال؛ سىز ئەركىن يۇمشاق دېتال ۋەخپىسى تارقاتقان GNU ئادەتتىكى ئاممىۋى ئىجازەتنامە بويىچە ئۇنى قايتا تارقىتىپ ياكى ئۆزگەرتەلەيسىز؛ سىز شۇ ئىجازەت كېلىشىمىنىڭ ئىككىنچى نەشرى ياكى يۇقىرى نەشرىنى ئىشلەتسىڭىز بولىدۇ.

source: This mailbox type does not require any configuration settings.
ug: بۇ تىپتىكى خەت ساندۇقىغا ھېچقانداق سەپلىمە كېرەك ئەمەس.

source: This manual describes version @PACKAGE_VERSION@ of Xfce4 Screenshooter.
ug: بۇ بولاق @PACKAGE_NAME@ نىڭ @PACKAGE_VERSION@ نەشرى ھەققىدىكى قوللانمىدۇر

source: This message was sent to a mailing list.
ug: بۇ ئۇچۇر خەت گۇرۇپپىسىغا يوللانغان.

source: This option controls whether the terminal will scroll down automatically whenever new output is generated by the commands running inside the terminal.
ug: بۇ تاللانسا تاللانسا، يېڭى قۇر كۆرسىتىلسە، ھەمىشە تۆۋەنگە سىيرىلىدىغان بولىدۇ.

source: This page appears to contain a user script. Do you wish to install it?
ug: مەزكۇر بەتتە ئىشلەتكۈچى قوليازما پروگراممىسى بار ئىكەن. ئورناتقۇڭىز بارمۇ؟

source: This page appears to contain a user style. Do you wish to install it?
ug: مەزكۇر بەتتە ئىشلەتكۈچى ئۇسلۇبى بار ئىكەن. ئورناتقۇڭىز بارمۇ؟

source: This page lists the conditions under which the action will appear in the file managers context menus. The file patterns are specified as a list of simple file patterns separated by semicolons (e.g. *.txt;*.doc). For an action to appear in the context menu of a file or folder, at least one of these patterns must match the name of the file or folder. Additionally, you can specify that the action should only appear for certain kinds of files.
ug: بۇ بەتتە ھۆججەت باشقۇرغۇنىڭ مەزمۇن تىزىملىكىدە مەشغۇلاتنى كۆرسىتىدىغان شەرتنى بەلگىلەيدۇ. ھۆججەت ئەندىزىلىرى ئادەتتە چېكىتلىك پەش ئارقىلىق ئايرىلىدۇ. («*.txt;*.doc» دېگەندەك) ھۆججەت ياكى قىسقۇچنىڭ مەزمۇن تىزىملىكىدە مەشغۇلاتنى كۆرسىتىش ئۈچۈن، ئەڭ ئاز دېگەندە بىر دانە ئەندىزە ھۆججەت ياكى قىسقۇچ ئاتى بىلەن ماسلىشىشى كېرەك. يەنە مەشغۇلاتنى پەقەت مەلۇم بىر تۇردىكى ھۆججەتنى تاللىغاندىمۇ كۆرۈنىدىغان قىلىشقا بولىدۇ.

source: This page lists the conditions under which the action will appear in the file managers context menus. The file patterns are specified as a list of simple file patterns separated by semicolons (e.g. *.txt;*.doc). For an action to appear in the context menu of a file or folder, atleast one of these patterns must match the name of the file or folder. Additionally, you can specify that the action should only appear for certain kinds of files.
ug: بۇ بەتتە ھۆججەت باشقۇرغۇنىڭ مەزمۇن تىزىملىكىدە مەشغۇلاتنى كۆرسىتىدىغان شەرتنى بەلگىلەيدۇ. ھۆججەت ئەندىزىلىرى ئادەتتە چېكىتلىك پەش ئارقىلىق ئايرىلىدۇ. («*.txt;*.doc» دېگەندەك) ھۆججەت ياكى قىسقۇچنىڭ مەزمۇن تىزىملىكىدە مەشغۇلاتنى كۆرسىتىش ئۈچۈن، ئەڭ ئاز دېگەندە بىر دانە ئەندىزە ھۆججەت ياكى قىسقۇچ ئاتى بىلەن ماسلىشىشى كېرەك. يەنە مەشغۇلاتنى پەقەت مەلۇم بىر تۇردىكى ھۆججەتنى تاللىغاندىمۇ كۆرۈنىدىغان قىلىشقا بولىدۇ.

source: This program is free software; you can redistribute it and/or modify it under the terms of the GNU General Public License as published by the Free Software Foundation; either version 2 of the License, or (at your option) any later version. This program is distributed in the hope that it will be useful, but WITHOUT ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the GNU General Public License for more details. You should have received a copy of the GNU General Public License along with this program; if not, write to the Free Software Foundation, Inc., 51 Franklin Street, Fifth Floor, Boston, MA 02110-1301, USA.
ug: بۇ پروگرامما ئەركىن يۇمشاق دېتال؛ سىز ئەركىن يۇمشاق دېتال ۋەخپىسى تارقاتقان GNU ئادەتتىكى ئاممىۋى ئىجازەتنامە بويىچە ئۇنى قايتا تارقىتىپ ياكى ئۆزگەرتەلەيسىز؛ سىز شۇ ئىجازەت كېلىشىمىنىڭ ئىككىنچى نەشرى ياكى يۇقىرى نەشرىنى ئىشلەتسىڭىز بولىدۇ(ئۆزىڭىز تاللايسىز). بۇ پروگراممىنى تارقىتىشتىكى مەقسەت سىزگە قۇلايلىق ئېلىپ كېلىش، ئەمما سودا ياكى باشقا ئالاھىدە قوللىنىشقا نىسبەتەن ھېچقانداق كاپالەت يوق. تېخىمۇ كۆپ تەپسىلاتلارنى GNU ئادەتتىكى ئاممىۋى ئىجازەتنامىسىدىن كۆرۈڭ. مەزكۇر پروگرامما بىلەن بىرگە ئادەتتىكى ئاممىۋى ئىجازەتنامە(GNU General Public)سى چوقۇم بىرگە بولىدۇ. ئۇنداق بولمىسا ئەركىن يۇمشاق دېتال ۋەخپىسىگە خەت يېزىڭ. ئادرېسى: 51 FranklinStreet, Fifth Floor, Boston, MA 02110-1301, USA.

source: This program uses strftime function to get time. Use any valid code to get time in the format you prefer. Some common codes are: %A = weekday %B = month %c = date & time %R = hour & minute %V = week number %Z = timezone in use %H = hours %M = minute %X = local time %x = local date
ug: بۇ پروگرامما ۋاقىتقا strftime نى ئىشلىتىدۇ. ئۆزىڭىز ياخشى كۆرىدىغان ۋاقىت فورماتى ئۈچۈن بىرەر ئىناۋەتلىك كود ئىشلىتىڭ. بەزى كۆپ ئىشلىتىدىغان كودلار: %A = ھەپتە %B = ئاي %c = چېسلا & ۋاقىت %R = سائەت & مىنۇت %V = ھەپتە نومۇرى %Z = ئىشلىتىۋاتقان ۋاقىت رايونى %H = سائەت %M = مىنۇت %X = يەرلىك ۋاقىت %x = يەرلىك چېسلا

source: This shortcut is already being used by a window manager action. Which action do you want to use?
ug: مەزكۇر تېزلەتمە باشقا كۆزنەك باشقۇرغۇدا ئىشلىتىلىۋاتىدۇ. قايسىنى ئىشلىتىسىز؟

source: This shortcut is already being used for another window manager action. Which action do you want to use?
ug: مەزكۇر تېزلەتمە باشقا كۆزنەك باشقۇرغۇدا ئىشلىتىلىۋاتىدۇ. قايسىنى ئىشلىتىسىز؟

source: This shortcut is already being used for something else.
ug: مەزكۇر تېزلەتمە باشقا يەردە ئىشلىتىلىۋاتىدۇ

source: This shortcut is already being used for the command '%s'. Which action do you want to use?
ug: مەزكۇر تېزلەتمە ‹%s› بۇيرۇقتا ئىشلىتىلىۋاتىدۇ. قايسىسىنى ئىشلىتىسىز؟

source: This system is using RandR %d.%d. For the display settings to work version 1.2 is required at least
ug: مەزكۇر سىستېمىدا RandR %d.%d ئىشلىتىلىۋاتىدۇ. كۆرسەتكۈچ تەڭشىكىنى ئىشلىتىش ئۈچۈن ئەڭ توۋەن بولغاندىمۇ 1.2 نەشرى زۆرۈردۇر

source: This text file '%s' seems to be an executable script. What do you want to do with it?
ug: مەزكۇر تېكىست ھۆججىتى ‹%s› ئىجرا بولىدىغان قوليازما پروگراممىسىدەك قىلىدۇ. What do you want to do with it؟

source: This will create a new launcher plugin on the panel and inserts the dropped files as menu items.
ug: بۇ قىستۇرما كۆزنىكىگە يېڭى ئىجراچى قۇرىدۇ ۋە تاشلانغان ھۆججەتنى تىزىملىك سۈپىتىدە ئىشلىتىدۇ.

source: This will open %d separate file manager window.
ug: %d دانە ھۆججەت باشقۇرغۇ كۆزنىكىدە ئايرىم-ئايرىم ئاچىدۇ

source: This will permanently clear the custom command history.
ug: بۇ بارلىق ئىختىيارىي بۇيرۇق ئىزىنى تازىلايدۇ.

source: This will permanently remove the application from the list of automatically started applications
ug: بۇ ئاپتوماتىك قوزغىلىدىغان پروگرامما تىزىملىكىدىن بۇ پروگراممىنى ئۆچۈرىدۇ.

source: This will permanently remove the custom desktop file from your home directory.
ug: ئىختىيارىي ئۈستەلئۈستى ھۆججىتى ماكان مۇندەرىجىڭىزدىن مەڭگۈلۈككە يوقىلىدۇ.

source: This will remove the application launcher that appears in the file context menu, but will not uninstall the application itself. You can only remove application launchers that were created using the custom command box in the "Open With" dialog of the file manager.
ug: مەزمۇن تىزىملىكىدە كۆرۈنگەن ئىجراچىنى ئۆچۈرىدۇ. بىراق پروگراممىنى سىستېمىدىن چىقىرىۋەتمەيدۇ(uninstall). ھۆججەت باشقۇرغۇنىڭ «پروگراممىدا ئاچ» دېگەن سۆزلەشكۈسىدىكى ئۆزلەشتۈرۈلگەن بۇيرۇق قاپچۇقىدا قۇرۇلغان پروگرامما ئىجراچىسىنىلا ئۆچۈرگىلى بولىدۇ.

source: This will remove your custom mime-association and restore the system-wide default.
ug: بۇنىڭ بىلەن سىز بەلگىلىگەن mime تىپى مۇناسىۋەتلىرى ئۆچۈرۈلۈپ سىستېمىنىڭ تەڭشىكى ئەسلىگە كېلىدۇ.

source: This will reset all shortcuts to their default values. Do you really want to do this?
ug: بۇ بارلىق تېزلەتمىلەرنىڭ كۆڭۈلدىكى قىممەتلىرىنى ئەسلىگە كەلتۈرۈۋاتىدۇ. بۇنى قىلسۇنمۇ؟

source: This window might be busy and is not responding. Do you want to terminate the application?
ug: مەزكۇر كۆزنەك ئالدىراش ئوخشايدۇ، جاۋاب كەلمەيۋاتىدۇ. پروگراممىنى ئاخىرلاشتۇرامسىز؟

source: This window will be displayed:
ug: مەزكۇر كۆزنەك كۆرسىتىلىدۇ:

source: This wireless network was encrypted. You must have the encryption key.
ug: مەزكۇر سىمسىز تور شىفىرلانغان. سىزدە چوقۇم شىفىرلاش ئاچقۇچى بولۇشى كېرەك.

source: Thu
ug: پەيشەنبە

source: Thumb_nail Size
ug: كىچىك سۈرەت چوڭلۇقى(_N)

source: Thumbnail Bar _Position
ug: كىچىك سۈرەت بالدىقىنىڭ ئورنى(_P)

source: Thumbnail View
ug: كىچىكلىتىلگەن سۈرەت كۆرۈنۈشى

source: Thumbnail could not be inferred from file contents
ug: كىچىك سۈرەتنى ھۆججەت مەزمۇنىدىن كەلتۈرۈپ چىقارغىلى بولمىدى

source: Thumbnails
ug: كىچىك سۈرەت

source: Thunar
ug: سۇنار(Thunar)

source: Thunar Bulk Rename is a powerful and extensible tool to rename multiple files at once.
ug: سۇنار(Thunar) ھۆججەت ئاتىنى توپ ئۆزگەرتكۈچ بولسا نۇرغۇن ھۆججەتلەرنىڭ ئاتىنى بىراقلا ئۆزگەرتىش قورالىدۇر.

source: Thunar File Manager
ug: سۇنار(Thunar) ھۆججەت باشقۇرغۇ

source: Thunar Volume Manager
ug: سۇنار(Thunar) دىسكا باشقۇرغۇ

source: Thunar Volume Manager Settings
ug: سۇنار(Thunar) دىسكا باشقۇرغۇ تەڭشەكلىرى

source: Thunar is a fast and easy to use file manager for the Xfce Desktop Environment.
ug: سۇنار(Thunar) بولسا Xfce ئۈستەلئۈستى سىستېمىسىدىكى ئىشلىتىش ئاددىي سۈرىتى تېز بولغان ھۆججەت باشقۇرغۇ.

source: Thunar needs to add some permissions to your folder in order to share it. Do you agree?
ug: سۇنار(Thunar) ھەمبەھىر قىلىدىغان مۇندەرىجىگە ھوقۇق بەلگىلەپ بېرىدۇ. قوشۇلامسىز؟

source: Thunar: %s
ug: سۇنار(Thunar): %s

source: Thunar: Failed to open display: %s
ug: سۇنار(Thunar): ئېكراننى ئېچىش مەغلۇپ بولدى: %s

source: Thunder showers
ug: ئۆتكۈنچى گۈلدۈرماما

source: Thundersnow
ug: گۈلدۈرمامىلىق قار

source: Ti_me:
ug: ۋاقىت(_M):

source: Tick to display label
ug: ئەننى كۆرسىتىش ئۈچۈن بەلگە قويۇڭ.

source: Tile the image to fill the entire screen
ug: پۈتۈن ئېكراننى قاپلىغۇدەك قىلىپ كاھىش شەكلىدە تىزىش

source: Tile window to the bottom
ug: ئاستى تەرەپكە كۆزنەكنى كاھىش شەكىلدە تىز

source: Tile window to the left
ug: سول تەرەپكە كۆزنەكنى كاھىش شەكىلدە تىز

source: Tile window to the right
ug: ئوڭ تەرەپكە كۆزنەكنى كاھىش شەكىلدە تىز

source: Tile window to the top
ug: ئۈستى تەرەپكە كۆزنەكنى كاھىش شەكىلدە تىز

source: Tiled
ug: كاھىشتەك

source: Time
ug: ۋاقىت

source: Time Out
ug: ۋاقىت ئېشىپ كەتتى

source: Time Settings
ug: ۋاقىت تەڭشەكلىرى

source: Time and Date _Settings...
ug: ۋاقىت ۋە چېسلا تەڭشەكلىرى(_S)…

source: Time between breaks:
ug: ئاراملار ئارىسىدىكى ۋاقىت:

source: Time interval (sec.)
ug: ۋاقىت ئىنتېرۋالى(سېكۇنت.)

source: Time left: %s
ug: قالغان ۋاقىت: %s

source: Time left: %s %s
ug: قالغان ۋاقىت: %s %s

source: Time left: %s %s %s
ug: قالغان ۋاقىت: %s %s %s

source: Time only
ug: ۋاقىتلا

source: Time range to clear:
ug: تازىلايدىغان ۋاقىت دائىرىسى:

source: Time settings
ug: ۋاقىت تەڭشىكى

source: Time yourself
ug: ئۆزىنىڭ ۋاقتى

source: Time, then date
ug: ۋاقىت ئاندىن چېسلا

source: Time_zone:
ug: ۋاقىت رايونى(_Z):

source: Timeout
ug: مۆھلىتى

source: Timeout Interval:
ug: ۋاقىت ھالقىش ئىنتېرۋالى:

source: Timer name
ug: ۋاقىت ئۆلچىگۈچ ئاتى

source: Timer %s
ug: ۋاقىت بەلگىلىگۈچ %s

source: Timer plugin for Xfce panel
ug: Xfce نىڭ ۋاقىت ئۆلچىگۈچ قىستۇرمىسى

source: Timestamp
ug: ۋاقىت(Timestamp)

source: Timezone
ug: ۋاقىت رايونى

source: Timezone of the clock:
ug: سائەتنىڭ ۋاقىت رايونى:

source: Timidity++ bank configuration file
ug: Timidity++ بانكا سەپلىمە ھۆججىتى

source: Tint each tab distinctly
ug: ھەر بىر بەتكۈچنى ئوخشىمىغان رەڭدە كۆرسەت

source: Title
ug: ماۋزۇ

source: Title Bar
ug: ماۋزۇ بالدىقى

source: Title Menu
ug: تېما تىزىملىكى

source: Title of the book, if only part of it is being cited
ug: نەقىل ئېلىنغان كىتابنىڭ ماۋزۇسى(ئازغىنە نەقىل ئېلىنغان بولسىمۇ)

source: Title of the work
ug: ئەسەرنىڭ ماۋزۇسى

source: Title:
ug: ماۋزۇ:

source: Titlebar text while playing:
ug: قويۇۋاتقان چاغدىكى ماۋزۇ بالدىقى تېكىستى:

source: Titlebar text while stopped:
ug: توختىغان چاغدىكى ماۋزۇ بالدىقى تېكىستى:

source: Titled Dialog
ug: ماۋزۇلۇق سۆزلەشكۈ

source: To Check Status
ug: ھالەتنى تەكشۈرسۇن

source: To help prevent accidental keystrokes, slow keys requires that a key is held for a certain minimum amount of time before the keystroke will be accepted
ug: خاتا بېسىلىپ قېلىشتىن ساقلىنىش ئۈچۈن ئىشلىتىلىدۇ. ئاستا كۇنۇپكىلار مەلۇم ۋاقىت بېسىلىپ تۇرۇلمىسا، كۇنۇپكا بېسىلمىدى دەپ قارىلىدۇ.

source: To help prevent accidental multiple keystrokes, bounce keys imposes a minimum delay between keystrokes
ug: خاتا بېسىلىپ قېلىشتىن ساقلىنىش ئۈچۈن ئىشلىتىلىدۇ. سەكرىمە كۇنۇپكىلار كۇنۇپكا بېسىلىپ مەلۇم ۋاقىت ئۆتكەندىن كېيىن كېيىنكى كۇنۇپكا بېسىلمىسا قوبۇل قىلىنمايدۇ.

source: To launch the application, use the "Screenshot" item in the "Accessories" category of Xfce's main menu.
ug: بۇ پروگراممىنى ئىجرا قىلىش ئۈچۈن Xfce نىڭ ئاساسىي تىزىملىكىدىن «قوشۇمچە دېتاللار» نىڭ ئىچىدىكى «Screenshot» نى تاللىسا بولىدۇ.

source: To unhide the item you have to manually remove the desktop file from "%s" or open the file in the same directory and remove the line "%s".
ug: بىرەر تۇرنى كۆرۈنىدىغان قىلىش ئۈچۈن ئۈستەلئۈستى ھۆججىتىنى «%s» دىن ئۆچۈرسىڭىز ياكى مۇشۇ مۇندەرىجىدىكى ھۆججەتنى ئېچىپ «%s» دېگەن قۇرنى ئۆچۈرۈۋەتسىڭىز بولىدۇ.

source: To use the above URI open a news aggregator. There is usually a menu or button "New Subscription", "New News Feed" or similar. Alternatively go to Preferences, Applications in Midori, and select a News Aggregator. Next time you click the news feed icon, it will be added automatically.
ug: يۇقىرىدىكى URI نى ئىشلىتىش ئۈچۈن خەۋەر ئوقۇغۇچ(news aggregator) نى ئېچىڭ. بۇ يەردە ئادەتتە «يېڭىدىن مۇشتەرى بولىمەن»، «يېڭى خەۋەر ئوقۇغۇچ» ياكى بولمىسا شۇنىڭغا يېقىن مەنىدىكى توپچا بار بولىدۇ. ياكى بولمىسا مىدورى(Midori) نىڭ مايىللىق دېگەن يېرىگە بېرىپ، خەۋەر ئوقۇغۇچ(news aggregator)نى تاللاڭ. شۇنىڭ بىلەن كېيىن قېتىم خەۋەر ئوقۇغۇچ سىنبەلگىسىنى چەكسىڭىز، ئاپتوماتىك قوشۇلىدۇ.

source: Today
ug: بۈگۈن

source: Today at %X
ug: بۈگۈن سائەت %X

source: Todo
ug: قىلىدىغان ئىشلار:

source: Toggle above
ug: ئۈستىدىكىسىگە ئالماشتۇر

source: Toggle breaking lines in between words
ug: قۇرنى قاتلىغاندا سۆزنى ئاساس قىلىدۇ

source: Toggle form history state
ug: جەدۋەل(form) ئىزىنىڭ ھالىتىنى ئالماشتۇرۇش

source: Toggle fullscreen
ug: پۈتۈن ئېكران شەكلىگە ئالماشتۇر

source: Toggle fullscreen mode
ug: تولۇق ئېكران ھالىتىنى ئۆزگەرتىش

source: Toggle fullscreen view
ug: تولۇق ئېكران كۆرسىتىش/كۆرسەتمەسلىكنى ئالماشتۇرىدۇ

source: Toggle text cursor navigation
ug: تېكىست نۇر بەلگىسى ئارقىلىق كۆرۈشكە ئۆزگەرت

source: Toggle the overwrite mode
ug: ئۈستىلەپ يېزىشنى ئالماشتۇرۇش

source: Toggle view mode
ug: كۆرۈنۈش ھالىتىنى ئۆزگەرتىش

source: Toggles the display of hidden files in the current window
ug: ھازىرقى كۆزنەكتىكى يوشۇرۇن ھۆججەتلەرنى ئېچىش/ئاچماسلىقنى ئۆزئارا ئۆزگەرتىدۇ

source: Toggles the visibility of the shortcuts pane
ug: تېزلەتمە كۆزنىكىنى كۆرسىتىش/كۆرسەتمەسلىكنى ئۆزئارا ئالماشتۇرىدۇ

source: Toggles the visibility of the tree pane
ug: دەرەخسىمان كۆزنەكنى كۆرسىتىش/كۆرسەتمەسلىكنى ئۆزئارا ئالماشتۇرىدۇ

source: Tomorrow
ug: ئەتە

source: Tool Bar Style
ug: قورال بالدىقى ئۇسلۇبى

source: Tool_s
ug: قوراللار(_S)

source: Toolbar
ug: قورال بالداق

source: Toolbar Editor
ug: قورال بالدىقى تەھرىرلىگۈ

source: Toolbar Icon Size:
ug: قورال بالدىقى چوڭلۇقى:

source: Toolbar Style:
ug: قورال بالدىقىنىڭ ئۇسلۇبى:

source: Toolbar _Style
ug: قورال بالدىقىنىڭ ئۇسلۇبى(_S)

source: Toolbar style:
ug: قورال بالداق ئۇسلۇبى:

source: Tools for software development
ug: يۇمشاق دېتال ئىجادىيەت قوراللىرى

source: Tooltip Format
ug: كۆرسەتمە پىچىمى

source: Tooltip Format :
ug: كۆرسەتمە پىچىمى:

source: Tooltip for the entry, for example "View sites on the Internet" in case of Firefox. Should not be redundant with the name or the description.
ug: مەزكۇر كىرگۈنىڭ كۆرسەتمىسىدۇر. مەسىلەن ئوتتۈلكىگە نىسبەتەن «ئىنتېرنېت تورتۇراسىنى كۆرسىتىدۇ» دەپ كۆرۈنىدۇ. ئىسىم ۋە چۈشەندۈرۈشى تەكرارلىنىپ قالمايدۇ.

source: Tooltip only
ug: كۆرسەتمىلا

source: Tooltip:
ug: كۆرسەتمە:

source: Tooltips Enabled
ug: كۆرسەتمە قوزغىتىلدى

source: Tooltips:
ug: كۆرسەتمىلەر:

source: Top
ug: ئۈستى

source: Top left
ug: ئۈستى سول

source: Top right
ug: ئۈستى ئوڭ

source: Total Tracks
ug: جەمئىي نەغمە

source: Touch Pad
ug: سەزگۈر تاختا

source: Tr_acking mode:
ug: ئىزلاش ئۇسۇلى(_A):

source: Track
ug: نەغمە

source: Track %i
ug: نەغمە %i

source: Track - Artist - Title
ug: نەغمە - ئورۇنلىغۇچى - ماۋزۇ

source: Track - Title
ug: نەغمە - ماۋزۇ

source: Track Name
ug: نەغمە ئاتى

source: Track No
ug: نەغمە نومۇرى

source: Track Number
ug: نەغمە نومۇرى

source: Track Properties
ug: نەغمە خاسلىقى

source: Track Title
ug: نەغمە ئاتى

source: Track number
ug: ناخشا نومۇرى

source: Track. Artist - Title
ug: نەغمە. ئورۇنلىغۇچى - ماۋزۇ

source: Track. Title
ug: نەغمە. ماۋزۇ

source: Tracked Core:
ug: كۆزىتىلىدىغان يادرو:

source: Traditional approach with location bar and navigation buttons
ug: ئورۇن بالدىقى ۋە يولچى توپچىلىرى بار ئەنئەنىۋى ئۇسۇل

source: Transd now uses a new configuration file format. Please see the README for details. Transd will now exit.
ug: Transd ئەمدى يېڭى سەپلىمە فورماتىنى ئىشلىتىدۇ. تەپسىلاتى ئۈچۈن README نى ئوقۇڭ. Transd ھازىر ئاخىرلىشىدۇ.

source: Transfer
ug: يوللاش

source: Transfer Error
ug: يوللاش خاتالىقى

source: Transfer completed
ug: ئۇزىتىش تاماملاندى

source: Transfers
ug: ئۇزاتقانلىرى

source: Translations supervision
ug: تەرجىمە يېتەكچىسى

source: Translator (%s)
ug: تەرجىمان (%s)

source: Translators
ug: تەرجىمانلار

source: Translators list from %s.
ug: تەرجىمانلار تىزىمى (%s دىن).

source: Transmitting
ug: يەتكۈزۈلدى

source: Transpare_ncy:
ug: سۈزۈكلۈك(_N):

source: Transparency Daemon
ug: سۈزۈكلۈك Daemon نى

source: Transparency when the pointer is hovering over the panel, with 0 being fully transparent and 100 fully opaque.
ug: ئىسترېلكا كۆزنەك ئۈستىدە بار چاغدىكى سۈزۈكلۈكى، 0 تولۇق سۈزۈك، 100 پۈتۈنلەي غۇۋا.

source: Transparency when the pointer is not hovering over the panel, with 0 being fully transparent and 100 fully opaque.
ug: ئىسترېلكا كۆزنەك ئۈستىدە يوق چاغدىكى سۈزۈكلۈكى، 0 تولۇق سۈزۈك، 100 پۈتۈنلەي غۇۋا.

source: Transparent
ug: سۈزۈك

source: Transparent background
ug: سۈزۈك تەگلىك

source: Transparent panel
ug: سۈزۈك كۆزنەك

source: Trash
ug: ئەخلەتخانا

source: Trash Applet
ug: ئەخلەتخانا قوللانچىقى

source: Trash Can
ug: ئەخلەتخانا

source: Trash Error
ug: ئەخلەتخانا خاتالىقى

source: Trash contains %d items
ug: ئەخلەتخانىدا %d نەرسە بار

source: Trash contains files
ug: ئەخلەتخانىدا ھۆججەت بار

source: Trash contains one item
ug: ئەخلەتخانىدا بىر نەرسە بار

source: Trash is empty
ug: ئەخلەتخانا قۇرۇق

source: Trashing files
ug: ھۆججەتلەرنى ئەخلەتخانىغا يۆتكەۋاتىدۇ

source: Tray icon
ug: قونداق سىنبەلگىسى

source: Tray icon plugin
ug: قونداق سىنبەلگە قىستۇرمىسى

source: Treat backup files as _hidden
ug: زاپاسلانغان ھۆججەتلەرنى يوشۇرۇن ھۆججەت دەپ بىر تەرەپ قىلسۇن(_H)

source: Tree Pane
ug: دەرەخسىمان كۆزنەك

source: Trigger Launcher Plugin
ug: Trigger ئىجراچى قىستۇرمىسى

source: Trim device names:
ug: ئۈسكۈنە ئاتىنى ئوڭلاش:

source: Trim the device names to the number of characters specified in the spin button.
ug: ئۈسكۈنە ئاتىنى باسما توپچىدا كۆرسىتىلگەن ھەرپ سانىغا ماسلاشتۇرۇپ ئوڭشايدۇ.

source: True
ug: راست
